; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	Star3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star1 - direction
	GroundStation2 - direction
	Star7 - direction
	GroundStation8 - direction
	Star0 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation8)
)
(:goal (and
	(have_image Star9 spectrograph1)
	(have_image Planet10 thermograph2)
	(have_image Star11 spectrograph1)
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon13 thermograph2)
	(have_image Planet14 thermograph2)
	(have_image Star15 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation2 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite1 planet10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet10)
   goals met: 0 of 7
5. (take_image satellite1 planet10 instrument2 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon13 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon13 instrument2 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 2 of 7
8. (turn_to satellite1 phenomenon12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 7
9. (take_image satellite1 phenomenon12 instrument2 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 3 of 7
10. (turn_to satellite1 planet14 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet14)
   goals met: 3 of 7
11. (take_image satellite1 planet14 instrument2 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 4 of 7
12. (turn_to satellite1 star11 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star11)
   goals met: 4 of 7
13. (take_image satellite1 star11 instrument2 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 5 of 7
14. (turn_to satellite1 star15 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star15)
   goals met: 5 of 7
15. (take_image satellite1 star15 instrument2 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 6 of 7
16. (turn_to satellite1 star9 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star9)
   goals met: 6 of 7
17. (take_image satellite1 star9 instrument2 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 7 of 7
